---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetInvalidElementInSketch
source: html/c85d1871-2780-1888-777e-4d2f50bcf99b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetInvalidElementInSketch Property

Arcs in a bend profile must be separated from one another with a connected straight segment. The bend profile cannot start or end with an arc. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetInvalidElementInSketch { get; }
```